Revit 2027 API
ComboBoxMemberData.Image Property
The image shown on the ComboBoxMember.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ImageSource Image { get; set; }
Public Property Image As ImageSource
	Get
	Set
public:
property ImageSource^ Image {
	ImageSource^ get ();
	void set (ImageSource^ value);
}
member Image : ImageSource with get, set
Property Value
ImageSource
Remarks
The image will be shown on the left side of the item when the item is added to a ComboBox. The best size is 16 x 16 pixels.
See Also
Reference
ComboBoxMemberData Class
Autodesk.Revit.UI Namespace